In [1]:
import numpy as np
import pandas as pd

In [2]:
columns_names = ['user_id','item_id','rating', 'timestamp']

In [3]:
df = pd.read_csv('u.data',sep='\t',names=columns_names)

In [4]:
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [5]:
 movie_titles = pd.read_csv('Movie_Id_Titles')

In [7]:
movie_titles.tail()

      item_id                                      title
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

In [8]:
df = pd.merge(df,movie_titles, on='item_id')

In [9]:
df.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

In [10]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('white')

In [11]:
%matplotlib inline